import {Recipe} from "@/components/Calculator/types";
import {NeedElements} from "@/calculator/types";

export const DEFAULT_MICRO_RECIPE: NeedElements = {
  Fe: 4500 / 1000,
  Mn: 636 / 1000,
  B: 636 / 1000,
  Zn: 384 / 1000,
  Cu: 69 / 1000,
  Mo: 69 / 1000,
}

export const DEFAULT_RECIPES: Recipe[] = [
  {
    'name': 'Перец Минвата Базовый',
    'elements': {
      'NO3': 224.0,
      'NH4': 14.0,
      'P': 39.0,
      'K': 264.0,
      'Ca': 200.0,
      'Mg': 36.0,
      'S': 56.0,
      'Cl': 0.0,
      'Fe': 0.84,
      'Mn': 0.55,
      'Zn': 0.33,
      'B': 0.32,
      'Cu': 0.06,
      'Mo': 0.05
    }
  },
  {
    'name': 'Перец Минвата Старт',
    'elements': {
      'NO3': 224.0,
      'NH4': 0.0,
      'P': 8.0,
      'K': 264.0,
      'Ca': 200.0,
      'Mg': 36.0,
      'S': 56.0,
      'Cl': 0.0,
      'Fe': 0.84,
      'Mn': 0.55,
      'Zn': 0.33,
      'B': 0.32,
      'Cu': 0.06,
      'Mo': 0.05
    }
  },
  {
    'name': 'Перец Минвата Жара',
    'elements': {
      'NO3': 224.0,
      'NH4': 7.0,
      'P': 39.0,
      'K': 225.0,
      'Ca': 220.0,
      'Mg': 43.0,
      'S': 56.0,
      'Cl': 0.0,
      'Fe': 1.4,
      'Mn': 0.55,
      'Zn': 0.33,
      'B': 0.43,
      'Cu': 0.06,
      'Mo': 0.05
    }
  },
  {
    'name': 'Перец Минвата Завязи',
    'elements': {
      'NO3': 238.0,
      'NH4': 14.0,
      'P': 39.0,
      'K': 303.0,
      'Ca': 200.0,
      'Mg': 36.0,
      'S': 56.0,
      'Cl': 0.0,
      'Fe': 0.84,
      'Mn': 0.55,
      'Zn': 0.33,
      'B': 0.32,
      'Cu': 0.06,
      'Mo': 0.05
    }
  },
  {
    'name': 'Перец Минвата Конец',
    'elements': {
      'NO3': 224.0,
      'NH4': 14.0,
      'P': 39.0,
      'K': 225.0,
      'Ca': 220.0,
      'Mg': 36.0,
      'S': 56.0,
      'Cl': 0.0,
      'Fe': 0.84,
      'Mn': 0.55,
      'Zn': 0.33,
      'B': 0.32,
      'Cu': 0.06,
      'Mo': 0.05
    }
  },
  {
    'name': 'Томат Минвата Базовый',
    'elements': {
      'NO3': 210.0,
      'NH4': 17.0,
      'P': 46.0,
      'K': 371.0,
      'Ca': 216.0,
      'Mg': 58.0,
      'S': 141.0,
      'Cl': 35.0,
      'Fe': 0.84,
      'Mn': 0.55,
      'Zn': 0.33,
      'B': 0.32,
      'Cu': 0.05,
      'Mo': 0.05
    }
  },
  {
    'name': 'Томат Минвата Старт',
    'elements': {
      'NO3': 210.0,
      'NH4': 3.0,
      'P': 15.0,
      'K': 371.0,
      'Ca': 216.0,
      'Mg': 58.0,
      'S': 141.0,
      'Cl': 35.0,
      'Fe': 0.84,
      'Mn': 0.55,
      'Zn': 0.33,
      'B': 0.32,
      'Cu': 0.05,
      'Mo': 0.05
    }
  },
  {
    'name': 'Томат Минвата Жара',
    'elements': {
      'NO3': 210.0,
      'NH4': 3.0,
      'P': 46.0,
      'K': 332.0,
      'Ca': 236.0,
      'Mg': 70.0,
      'S': 141.0,
      'Cl': 35.0,
      'Fe': 1.4,
      'Mn': 0.55,
      'Zn': 0.33,
      'B': 0.43,
      'Cu': 0.05,
      'Mo': 0.05
    }
  },
  {
    'name': 'Томат Минвата Завязи',
    'elements': {
      'NO3': 210.0,
      'NH4': 17.0,
      'P': 46.0,
      'K': 430.0,
      'Ca': 196.0,
      'Mg': 52.0,
      'S': 141.0,
      'Cl': 35.0,
      'Fe': 0.84,
      'Mn': 0.55,
      'Zn': 0.33,
      'B': 0.32,
      'Cu': 0.05,
      'Mo': 0.05
    }
  },
  {
    'name': 'Томат Минвата Конец',
    'elements': {
      'NO3': 210.0,
      'NH4': 17.0,
      'P': 46.0,
      'K': 332.0,
      'Ca': 236.0,
      'Mg': 58.0,
      'S': 141.0,
      'Cl': 35.0,
      'Fe': 0.84,
      'Mn': 0.55,
      'Zn': 0.33,
      'B': 0.32,
      'Cu': 0.05,
      'Mo': 0.05
    }
  },
  {
    'name': 'Земляника Минвата Базовый',
    'elements': {
      'NO3': 168.0,
      'NH4': 14.0,
      'P': 31.0,
      'K': 188.0,
      'Ca': 144.0,
      'Mg': 36.0,
      'S': 48.0,
      'Cl': 0.0,
      'Fe': 1.68,
      'Mn': 0.55,
      'Zn': 0.46,
      'B': 0.11,
      'Cu': 0.05,
      'Mo': 0.05
    }
  },
  {
    'name': 'Земляника Минвата Старт',
    'elements': {
      'NO3': 193.0,
      'NH4': 14.0,
      'P': 39.0,
      'K': 188.0,
      'Ca': 184.0,
      'Mg': 36.0,
      'S': 48.0,
      'Cl': 0.0,
      'Fe': 2.23,
      'Mn': 0.82,
      'Zn': 0.46,
      'B': 0.22,
      'Cu': 0.05,
      'Mo': 0.05
    }
  },
  {
    'name': 'Земляника Минвата Завязи',
    'elements': {
      'NO3': 189.0,
      'NH4': 7.0,
      'P': 31.0,
      'K': 266.0,
      'Ca': 144.0,
      'Mg': 36.0,
      'S': 48.0,
      'Cl': 0.0,
      'Fe': 1.68,
      'Mn': 0.55,
      'Zn': 0.46,
      'B': 0.11,
      'Cu': 0.05,
      'Mo': 0.05
    }
  },
  {
    'name': 'Огурец Минвата Базовый',
    'elements': {
      'NO3': 224.0,
      'NH4': 18.0,
      'P': 39.0,
      'K': 313.0,
      'Ca': 160.0,
      'Mg': 33.0,
      'S': 44.0,
      'Cl': 0.0,
      'Fe': 0.84,
      'Mn': 0.55,
      'Zn': 0.33,
      'B': 0.27,
      'Cu': 0.05,
      'Mo': 0.05
    }
  },
  {
    'name': 'Огурец Минвата Старт',
    'elements': {
      'NO3': 224.0,
      'NH4': 4.0,
      'P': 8.0,
      'K': 313.0,
      'Ca': 160.0,
      'Mg': 33.0,
      'S': 44.0,
      'Cl': 0.0,
      'Fe': 0.84,
      'Mn': 0.55,
      'Zn': 0.33,
      'B': 0.27,
      'Cu': 0.05,
      'Mo': 0.05
    }
  },
  {
    'name': 'Огурец Минвата Жара',
    'elements': {
      'NO3': 224.0,
      'NH4': 11.0,
      'P': 39.0,
      'K': 274.0,
      'Ca': 180.0,
      'Mg': 39.0,
      'S': 44.0,
      'Cl': 0.0,
      'Fe': 1.4,
      'Mn': 0.55,
      'Zn': 0.33,
      'B': 0.38,
      'Cu': 0.05,
      'Mo': 0.05
    }
  },
  {
    'name': 'Огурец Минвата Завязи',
    'elements': {
      'NO3': 238.0,
      'NH4': 18.0,
      'P': 39.0,
      'K': 352.0,
      'Ca': 160.0,
      'Mg': 33.0,
      'S': 44.0,
      'Cl': 0.0,
      'Fe': 0.84,
      'Mn': 0.55,
      'Zn': 0.33,
      'B': 0.27,
      'Cu': 0.05,
      'Mo': 0.05
    }
  },
  {
    'name': 'Огурец Минвата Минвата Конец',
    'elements': {
      'NO3': 224.0,
      'NH4': 18.0,
      'P': 39.0,
      'K': 274.0,
      'Ca': 180.0,
      'Mg': 33.0,
      'S': 44.0,
      'Cl': 0.0,
      'Fe': 0.84,
      'Mn': 0.55,
      'Zn': 0.33,
      'B': 0.27,
      'Cu': 0.05,
      'Mo': 0.05
    }
  },
]
