var e=`# Гайд новичка (и для ленивых)

## Инвентарь

Для начала необходимо иметь минимальный набор:

* Ювелирные весы 500г с точностью 0.01г
* Измеритель EC/pH/TDS/temp. Комбинированое устройство. pH опционален. \\
  Главное чтобы был EC (кондуктометр), это основная единица измерения
* Химические перчатки и респиратор - в процессе взятия навески лучше свести контакт с удобрениями к минимуму


## Удобрения

Необходимый минимум удобрений достаточный для выращивания от начала до конца

* \`Нитрат кальция\` (Кальциевая селитра) CaNO3. В идеале от буйских удобрений, короче смотрите чтобы без добавок был.
  \`\`\`
  CaO=24 N=14.9
  \`\`\`
* \`Акварин хвойный\` - комплексное удобрение. \\
  \`\`\`
  NO3=3 P2O5=11 K2O=35 MgO=4 S=9 Fe=0.054 Zn=0.014 Cu=0.01 Mn=0.042 Mo=0.004 B=0.02
  \`\`\`
* \`Аквамикс Л\`- комплекс микроэлементов
  \`\`\`
  Fe=4.1 Mn=3 Zn=0.63 Mg=0.9 Cu=0.63 Mo=0.17 Co=0.06
  \`\`\`
* \`Fe 6% ЭДДГА\` -- опционально при наличии проблем с железом, этот хелат самый устойчивый

Состав может меняться, уточняйте процентовки у своих удобрений


## Расчет

### Кратко

* \`Нитрат кальция\` - 1 г\\л
* \`Акварин хвойный\` - 0.8 г\\л


## Подробнее

Базовая навеска

* \`Нитрат кальция\` - 1 г\\л
* \`Акварин хвойный\` - 0.8 г\\л

Дают профиль \`N=209.6 NO3=209.6 NH4=0 P=39 K=296.6 Ca=231.3 Mg=24.6 S=79.1\` и \`EC=2\`

Ориентируйтесь по солености воды, если используете дождевую воду - поправку на жесткость воды не делаем. 

если вода жесткая - измеряем ЕС воды, и в калькуляторе пересчитываем профиль на \`EC = EC_target - EC_воды\`

Например в случае моей колодезной воды с \`EC=0.6\` то EC профиля дб около \`EC = 2.3 - 0.6 = 1.7\`, можно чуть поднять, растения впринципе до EC=3 норм живут.
`;export{e as default};